Oryx-Embedded/CycloneTCP/drivers/mac/at32f4xx_eth_driver.c
/**
 * @file at32f4xx_eth_driver.c
 * @brief Artery AT32F4 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Device-specific definitions
#if defined(AT32F407RGT7) || defined(AT32F407VGT7) || defined(AT32F407RCT7) || \
   defined(AT32F407VCT7) || defined(AT32F407VET7) || defined(AT32F407RET7) || \
   defined(AT32F407AVCT7) || defined(AT32F407AVGT7)
   #include "at32f403a_407.h"
#elif defined(AT32F437RCT7) || defined(AT32F437RGT7) || defined(AT32F437RMT7) || \
   defined(AT32F437VCT7) || defined(AT32F437VGT7) || defined(AT32F437VMT7) || \
   defined(AT32F437ZCT7) || defined(AT32F437ZGT7) || defined(AT32F437ZMT7)
   #include "at32f435_437.h"
#endif

//Dependencies
#include "core/net.h"
#include "drivers/mac/at32f4xx_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//Transmit buffer
#pragma data_alignment = 4
static uint8_t txBuffer[AT32F4XX_ETH_TX_BUFFER_COUNT][AT32F4XX_ETH_TX_BUFFER_SIZE];
//Receive buffer
#pragma data_alignment = 4
static uint8_t rxBuffer[AT32F4XX_ETH_RX_BUFFER_COUNT][AT32F4XX_ETH_RX_BUFFER_SIZE];
//Transmit DMA descriptors
#pragma data_alignment = 4
static At32f4xxTxDmaDesc txDmaDesc[AT32F4XX_ETH_TX_BUFFER_COUNT];
//Receive DMA descriptors
#pragma data_alignment = 4
static At32f4xxRxDmaDesc rxDmaDesc[AT32F4XX_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//Transmit buffer
static uint8_t txBuffer[AT32F4XX_ETH_TX_BUFFER_COUNT][AT32F4XX_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Receive buffer
static uint8_t rxBuffer[AT32F4XX_ETH_RX_BUFFER_COUNT][AT32F4XX_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(4)));
//Transmit DMA descriptors
static At32f4xxTxDmaDesc txDmaDesc[AT32F4XX_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4)));
//Receive DMA descriptors
static At32f4xxRxDmaDesc rxDmaDesc[AT32F4XX_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4)));

#endif

//Pointer to the current TX DMA descriptor
static At32f4xxTxDmaDesc *txCurDmaDesc;
//Pointer to the current RX DMA descriptor
static At32f4xxRxDmaDesc *rxCurDmaDesc;


/**
 * @brief AT32F4 Ethernet MAC driver
 **/

const NicDriver at32f4xxEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   at32f4xxEthInit,
   at32f4xxEthTick,
   at32f4xxEthEnableIrq,
   at32f4xxEthDisableIrq,
   at32f4xxEthEventHandler,
   at32f4xxEthSendPacket,
   at32f4xxEthUpdateMacAddrFilter,
   at32f4xxEthUpdateMacConfig,
   at32f4xxEthWritePhyReg,
   at32f4xxEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief AT32F4 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t at32f4xxEthInit(NetInterface *interface)
{
   error_t error;

   //Debug message
   TRACE_INFO("Initializing AT32F4 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   at32f4xxEthInitGpio(interface);

   //Enable Ethernet MAC clock
   crm_periph_clock_enable(CRM_EMAC_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_EMACTX_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_EMACRX_PERIPH_CLOCK, TRUE);

   //Reset Ethernet MAC peripheral
   crm_periph_reset(CRM_EMAC_PERIPH_RESET, TRUE);
   crm_periph_reset(CRM_EMAC_PERIPH_RESET, FALSE);

   //Perform a software reset
   EMAC_DMA->bm |= EMAC_DMA_BM_SWR;
   //Wait for the reset to complete
   while((EMAC_DMA->bm & EMAC_DMA_BM_SWR) != 0)
   {
   }

   //Adjust MDC clock range depending on HCLK frequency
   EMAC->miiaddr = EMAC_MIIADDR_CR_DIV_124;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Use default MAC configuration
   EMAC->ctrl = EMAC_CTRL_RESERVED15 | EMAC_CTRL_DRO;

   //Set the MAC address of the station
   EMAC->a0l = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   EMAC->a0h = interface->macAddr.w[2] | EMAC_A0H_AE;

   //The MAC supports 3 additional addresses for unicast perfect filtering
   EMAC->a1l = 0;
   EMAC->a1h = 0;
   EMAC->a2l = 0;
   EMAC->a2h = 0;
   EMAC->a3l = 0;
   EMAC->a3h = 0;

   //Initialize hash table
   EMAC->htl = 0;
   EMAC->hth = 0;

   //Configure the receive filter
   EMAC->frmf = EMAC_FRMF_HPF | EMAC_FRMF_HMC;
   //Disable flow control
   EMAC->fctrl = 0;
   //Enable store and forward mode
   EMAC_DMA->opm = EMAC_DMA_OPM_RSF | EMAC_DMA_OPM_TSF;

   //Configure DMA bus mode
   EMAC_DMA->bm = EMAC_DMA_BM_AAB | EMAC_DMA_BM_USP | EMAC_DMA_BM_RDP_32 |
      EMAC_DMA_BM_PR_1_1 | EMAC_DMA_BM_PBL_32;

   //Initialize DMA descriptor lists
   at32f4xxEthInitDmaDesc(interface);

