Oryx-Embedded/CycloneTCP/drivers/mac/at32f4xx_eth_driver.c
   //Prevent interrupts from being generated when the transmit statistic
   //counters reach half their maximum value
   EMAC_MMC->tim = EMAC_MMC_TIM_TGFCIM | EMAC_MMC_TIM_TMCGFCIM |
      EMAC_MMC_TIM_TSCGFCIM;

   //Prevent interrupts from being generated when the receive statistic
   //counters reach half their maximum value
   EMAC_MMC->rim = EMAC_MMC_RIM_RUGFCIM | EMAC_MMC_RIM_RAEFACIM |
      EMAC_MMC_RIM_RCEFCIM;

   //Disable MAC interrupts
   EMAC->imr = EMAC_IMR_TIM | EMAC_IMR_PIM;
   //Enable the desired DMA interrupts
   EMAC_DMA->ie = EMAC_DMA_IE_NIE | EMAC_DMA_IE_RIE | EMAC_DMA_IE_TIE;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(AT32F4XX_ETH_IRQ_PRIORITY_GROUPING);

   //Configure Ethernet interrupt priority
   NVIC_SetPriority(EMAC_IRQn, NVIC_EncodePriority(AT32F4XX_ETH_IRQ_PRIORITY_GROUPING,
      AT32F4XX_ETH_IRQ_GROUP_PRIORITY, AT32F4XX_ETH_IRQ_SUB_PRIORITY));

   //Enable MAC transmission and reception
   EMAC->ctrl |= EMAC_CTRL_TE | EMAC_CTRL_RE;
   //Enable DMA transmission and reception
   EMAC_DMA->opm |= EMAC_DMA_OPM_SSTC | EMAC_DMA_OPM_SSR;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void at32f4xxEthInitGpio(NetInterface *interface)
{
//AT-START-F407 evaluation board?
#if defined(AT_START_F407_V1)
   gpio_init_type gpio_init_struct;

   //Enable IOMUX clock
   crm_periph_clock_enable(CRM_IOMUX_PERIPH_CLOCK, TRUE);

   //Enable GPIO clocks
   crm_periph_clock_enable(CRM_GPIOA_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOB_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOC_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOD_PERIPH_CLOCK, TRUE);

   //Remap EMAC pins
   gpio_pin_remap_config(EMAC_MUX, TRUE);

   //Select RMII interface mode
   gpio_pin_remap_config(MII_RMII_SEL_GMUX, TRUE);

   //Get default parameters
   gpio_default_para_init(&gpio_init_struct);

   //Configure CLKOUT (PA8) as an output
   gpio_init_struct.gpio_pins = GPIO_PINS_8;
   gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
   gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
   gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
   gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
   gpio_init(GPIOA, &gpio_init_struct);

   //Configure CLKOUT pin to output SCLK/8 clock (25MHz)
   crm_clock_out_set(CRM_CLKOUT_SCLK);
   crm_clkout_div_set(CRM_CLKOUT_DIV_8);

   //Configure RMII pins
   gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
   gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
   gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
   gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;

   //Configure EMAC_RMII_REF_CLK (PA1) and EMAC_MDIO (PA2)
   gpio_init_struct.gpio_pins = GPIO_PINS_1 | GPIO_PINS_2;
   gpio_init(GPIOA, &gpio_init_struct);

   //Configure EMAC_RMII_TX_EN (PB11), EMAC_RMII_TXD0 (PB12) and
   //EMAC_RMII_TXD1 (PB13)
   gpio_init_struct.gpio_pins = GPIO_PINS_11 | GPIO_PINS_12 | GPIO_PINS_13;
   gpio_init(GPIOB, &gpio_init_struct);

   //Configure EMAC_MDC (PC1)
   gpio_init_struct.gpio_pins = GPIO_PINS_1;
   gpio_init(GPIOC, &gpio_init_struct);

   //Configure EMAC_RMII_CRS_DV (PD8), EMAC_RMII_RXD0 (PD9) and
   //EMAC_RMII_RXD1 (PD10)
   gpio_init_struct.gpio_pins = GPIO_PINS_8 | GPIO_PINS_9 | GPIO_PINS_10;
   gpio_init(GPIOD, &gpio_init_struct);

   //Configure PHY_RST (PC8)
   gpio_init_struct.gpio_pins = GPIO_PINS_8;
   gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
   gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
   gpio_init_struct.gpio_mode = GPIO_MODE_OUTPUT;
   gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
   gpio_init(GPIOC, &gpio_init_struct);

   //Reset PHY transceiver
   gpio_bits_write(GPIOC, GPIO_PINS_8, FALSE);
   sleep(10);
   gpio_bits_write(GPIOC, GPIO_PINS_8, TRUE);
   sleep(10);

//AT-START-F437 evaluation board?
#elif defined(AT_START_F437_V1)
   gpio_init_type gpio_init_struct;

   //Enable SCFG clock
   crm_periph_clock_enable(CRM_SCFG_PERIPH_CLOCK, TRUE);

   //Enable GPIO clocks
   crm_periph_clock_enable(CRM_GPIOA_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOC_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOD_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOE_PERIPH_CLOCK, TRUE);
   crm_periph_clock_enable(CRM_GPIOG_PERIPH_CLOCK, TRUE);

   //Select RMII interface mode
   scfg_emac_interface_set(SCFG_EMAC_SELECT_RMII);

   //Get default parameters
   gpio_default_para_init(&gpio_init_struct);

   //Configure CLKOUT1 (PA8) as an output
   gpio_init_struct.gpio_pins = GPIO_PINS_8;
   gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
   gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
   gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
   gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;
   gpio_init(GPIOA, &gpio_init_struct);

   //Remap CLKOUT1 pin
   gpio_pin_mux_config(GPIOA, GPIO_PINS_SOURCE8, GPIO_MUX_0);

   //Configure CLKOUT1 pin to output PLLCLK/10 clock (25MHz)
   crm_clock_out1_set(CRM_CLKOUT1_PLL);
   crm_clkout_div_set(CRM_CLKOUT_INDEX_1, CRM_CLKOUT_DIV1_5, CRM_CLKOUT_DIV2_2);

   //Configure RMII pins
   gpio_init_struct.gpio_out_type = GPIO_OUTPUT_PUSH_PULL;
   gpio_init_struct.gpio_pull = GPIO_PULL_NONE;
   gpio_init_struct.gpio_mode = GPIO_MODE_MUX;
   gpio_init_struct.gpio_drive_strength = GPIO_DRIVE_STRENGTH_STRONGER;

   //Configure EMAC_RMII_REF_CLK (PA1) and EMAC_MDIO (PA2)
   gpio_init_struct.gpio_pins = GPIO_PINS_1 | GPIO_PINS_2;
   gpio_init(GPIOA, &gpio_init_struct);

   //Configure EMAC_MDC (PC1)
   gpio_init_struct.gpio_pins = GPIO_PINS_1;
   gpio_init(GPIOC, &gpio_init_struct);

   //Configure EMAC_RMII_CRS_DV (PD8), EMAC_RMII_RXD0 (PD9) and
   //EMAC_RMII_RXD1 (PD10)
   gpio_init_struct.gpio_pins = GPIO_PINS_8 | GPIO_PINS_9 | GPIO_PINS_10;
   gpio_init(GPIOD, &gpio_init_struct);

   //Configure EMAC_RMII_TX_EN (PG11), EMAC_RMII_TXD0 (PG13) and
   //EMAC_RMII_TXD1 (PG14)
   gpio_init_struct.gpio_pins = GPIO_PINS_11 | GPIO_PINS_13 | GPIO_PINS_14;
   gpio_init(GPIOG, &gpio_init_struct);

