Oryx-Embedded/CycloneTCP/drivers/mac/at32f4xx_eth_driver.c
   //Configure the second unicast address filter
   if(j >= 2)
   {
      //When the AE bit is set, the entry is used for perfect filtering
      EMAC->a2l = unicastMacAddr[1].w[0] | (unicastMacAddr[1].w[1] << 16);
      EMAC->a2h = unicastMacAddr[1].w[2] | EMAC_A2H_AE;
   }
   else
   {
      //When the AE bit is cleared, the entry is ignored
      EMAC->a2l = 0;
      EMAC->a2h = 0;
   }

   //Configure the third unicast address filter
   if(j >= 3)
   {
      //When the AE bit is set, the entry is used for perfect filtering
      EMAC->a3l = unicastMacAddr[2].w[0] | (unicastMacAddr[2].w[1] << 16);
      EMAC->a3h = unicastMacAddr[2].w[2] | EMAC_A3H_AE;
   }
   else
   {
      //When the AE bit is cleared, the entry is ignored
      EMAC->a3l = 0;
      EMAC->a3h = 0;
   }

   //Configure the multicast hash table
   EMAC->htl = hashTable[0];
   EMAC->hth = hashTable[1];

   //Debug message
   TRACE_DEBUG("  EMAC->htl = 0x%08" PRIX32 "\r\n", EMAC->htl);
   TRACE_DEBUG("  EMAC->hth = 0x%08" PRIX32 "\r\n", EMAC->hth);

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Adjust MAC configuration parameters for proper operation
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t at32f4xxEthUpdateMacConfig(NetInterface *interface)
{
   uint32_t config;

   //Read current MAC configuration
   config = EMAC->ctrl;

   //10BASE-T or 100BASE-TX operation mode?
   if(interface->linkSpeed == NIC_LINK_SPEED_100MBPS)
   {
      config |= EMAC_CTRL_FES;
   }
   else
   {
      config &= ~EMAC_CTRL_FES;
   }

   //Half-duplex or full-duplex mode?
   if(interface->duplexMode == NIC_FULL_DUPLEX_MODE)
   {
      config |= EMAC_CTRL_DM;
   }
   else
   {
      config &= ~EMAC_CTRL_DM;
   }

   //Update MAC configuration register
   EMAC->ctrl = config;

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Write PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @param[in] data Register value
 **/

void at32f4xxEthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data)
{
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_WRITE)
   {
      //Take care not to alter MDC clock configuration
      temp = EMAC->miiaddr & EMAC_MIIADDR_CR;
      //Set up a write operation
      temp |= EMAC_MIIADDR_MW | EMAC_MIIADDR_MB;
      //PHY address
      temp |= (phyAddr << 11) & EMAC_MIIADDR_PA;
      //Register address
      temp |= (regAddr << 6) & EMAC_MIIADDR_MII;

      //Data to be written in the PHY register
      EMAC->miidt = data & EMAC_MIIDT_MD;

      //Start a write operation
      EMAC->miiaddr = temp;
      //Wait for the write to complete
      while((EMAC->miiaddr & EMAC_MIIADDR_MB) != 0)
      {
      }
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
   }
}


/**
 * @brief Read PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @return Register value
 **/

uint16_t at32f4xxEthReadPhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr)
{
   uint16_t data;
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_READ)
   {
      //Take care not to alter MDC clock configuration
      temp = EMAC->miiaddr & EMAC_MIIADDR_CR;
      //Set up a read operation
      temp |= EMAC_MIIADDR_MB;
      //PHY address
      temp |= (phyAddr << 11) & EMAC_MIIADDR_PA;
      //Register address
      temp |= (regAddr << 6) & EMAC_MIIADDR_MII;

      //Start a read operation
      EMAC->miiaddr = temp;
      //Wait for the read to complete
      while((EMAC->miiaddr & EMAC_MIIADDR_MB) != 0)
      {
      }

      //Get register value
      data = EMAC->miidt & EMAC_MIIDT_MD;
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
      data = 0;
   }

   //Return the value of the PHY register
   return data;
}


/**
 * @brief CRC calculation
 * @param[in] data Pointer to the data over which to calculate the CRC
 * @param[in] length Number of bytes to process
 * @return Resulting CRC value
 **/

uint32_t at32f4xxEthCalcCrc(const void *data, size_t length)
{
   uint_t i;
   uint_t j;
   uint32_t crc;
   const uint8_t *p;

   //Point to the data over which to calculate the CRC
   p = (uint8_t *) data;
   //CRC preset value
   crc = 0xFFFFFFFF;

   //Loop through data
   for(i = 0; i < length; i++)
   {
      //The message is processed bit by bit
      for(j = 0; j < 8; j++)
      {
         //Update CRC value
         if((((crc >> 31) ^ (p[i] >> j)) & 0x01) != 0)
         {
            crc = (crc << 1) ^ 0x04C11DB7;
         }
         else
         {
            crc = crc << 1;
         }
      }
   }

   //Return CRC value
   return ~crc;
}
